## 데이터 전처리를 위한 Python Quiz

---

### 주어진 날짜별 코스피 상장사 주가 데이터(kospi.csv)에서 아래의 문항에 맞는 코드를 작성하세요.

---

#### (1) kospi_df 의 변수 이름으로 csv 파일을 데이터 프레임으로 불러오세요.

In [44]:
kospi_df = pd.read_csv("./01_데이터 전처리를 위한 퀴즈/kospi.csv")
kospi_df.head(10)

,aq,cr,cv,dt,hv,lv,ncv,ov,rf,name
0,6873613,0.590000,300,20191210,51600.0,50700.0,51500,51000.0,2,삼성전자
1,8470627,1.587301,800,20191209,51400.0,50700.0,51200,50900.0,2,삼성전자
2,11414563,1.818182,900,20191206,50900.0,49950.0,50400,50100.0,2,삼성전자
3,10449715,0.101112,50,20191205,50400.0,49500.0,49500,50200.0,2,삼성전자
4,13246549,-0.901804,-450,20191204,49850.0,49000.0,49450,49600.0,5,삼성전자
5,12059812,-0.992063,-500,20191203,50300.0,49500.0,49900,49800.0,5,삼성전자
6,18877252,0.198807,100,20191202,51300.0,50400.0,50400,50900.0,2,삼성전자
7,11179334,-1.949318,-1000,20191129,51400.0,50200.0,50300,51200.0,5,삼성전자
8,6833885,-1.724138,-900,20191128,52100.0,51300.0,51300,51900.0,5,삼성전자
9,7546261,0.772201,400,20191127,52300.0,51600.0,52200,51800.0,2,삼성전자

#### (2) 파일에 있는 유니크한 날짜수(dt)와 기업수(name)를 출력하세요.

In [45]:
cd ./02_numpy_pandas/

[Errno 2] No such file or directory: './02_numpy_pandas/'
/Users/caterina/Dropbox/Study/Fast Campus/Data Science School/DSS1/03_aws

In [46]:
import warnings
warnings.filterwarnings("ignore")

In [47]:
df1 = pd.DataFrame(kospi_df.dt)
df2 = pd.DataFrame(kospi_df.cr)
df3 = pd.concat([df2, df1], axis=1)
df3.head(10)

         cr        dt
0  0.590000  20191210
1  1.587301  20191209
2  1.818182  20191206
3  0.101112  20191205
4 -0.901804  20191204
5 -0.992063  20191203
6  0.198807  20191202
7 -1.949318  20191129
8 -1.724138  20191128
9  0.772201  20191127

In [48]:
len(pd.unique(kospi_df["dt"]))

100

In [49]:
len(pd.unique(kospi_df["name"]))

100

#### (3) 2019년 12월 08일 이후의 날짜별 평균 상승률을 소수 셋째자리까지 리스트의 딕셔너리 형태로 데이터를 출력하세요.
 -  (dt : 날짜, cr : 상승률)
 - (출력 포멧 예시 : [{'dt': 20191109, 'cr': -1.234}, {'dt': 20191110, 'cr': 5.512}])

In [50]:
dt1 = kospi_df[kospi_df["dt"] >= 20191208].groupby('dt').agg('mean')
dt1.tail()

,aq,cr,cv,hv,lv,ncv,ov,rf
dt,,,,,,,,
20191209,746236.6,-0.041143,-167.25,113326.0,111206.75,112256.05,112455.45,3.46
20191210,596375.2,0.544600,521.40,113647.2,111055.25,112777.45,112030.35,2.94

In [51]:
dt1 = df3[df3["dt"] >= 20191208]
dt1 = dt1.groupby('dt').agg('mean')
dt1.tail()

                cr
dt
20191209 -0.041143
20191210  0.544600

In [52]:
df4 = dt1.pivot_table("cr", "dt", aggfunc='mean').reset_index()
df4 = round((df4), 3)
df4

         dt     cr
0  20191209 -0.041
1  20191210  0.545

In [53]:
df5 = df4.to_dict("recode")
df5

[{'dt': 20191209, 'cr': -0.041}, {'dt': 20191210, 'cr': 0.545}]

#### (4) 2019년 10월 21일 상승률 상위 5개회사를 출력하세요. (cr : 상승률)

In [54]:
df6 = kospi_df[["dt", "name", "cr"]]
dt2 = df6[df6["dt"] == 20191021]
cr1 = dt2.sort_values(["cr"], ascending=False)
cr1

            dt     name        cr
4436  20191021  LG디스플레이  3.928571
2536  20191021    엔씨소프트  3.689320
5636  20191021      오리온  3.000000
3136  20191021     삼성전기  2.739726
5836  20191021   CJ제일제당  2.690583
...        ...      ...       ...
4936  20191021     현대건설 -1.901566
9036  20191021     GS건설 -2.286585
9936  20191021  메리츠종금증권 -2.294056
5536  20191021     현대제철 -2.486188
6236  20191021     롯데지주 -2.594034

[100 rows x 3 columns]

In [55]:
cr2 = cr1.reset_index(drop=True, inplace=False)
cr2.loc[:4]

         dt     name        cr
0  20191021  LG디스플레이  3.928571
1  20191021    엔씨소프트  3.689320
2  20191021      오리온  3.000000
3  20191021     삼성전기  2.739726
4  20191021   CJ제일제당  2.690583

In [56]:
cr2['name'][:5].values

array(['LG디스플레이', '엔씨소프트', '오리온', '삼성전기', 'CJ제일제당'], dtype=object)

#### (5) 2019년 11월 30일에서 2019년 12월 5일까지 일별 상승률 상위 5개 회사의 평균 상승율을 소수점 셋째 자리까지 출력하세요. (cr : 상승률)

In [125]:
dt3 = df6[(df6["dt"] >= 20191130) & (df6["dt"] <= 20191205)]

# df7 = dt3.groupby(["dt", "name", 'cr'], sort=True)
df7 = dt3.sort_values(['dt','cr'], ascending=False)[["dt", "name", 'cr']]
df7 = round((df7), 3)

df7.reset_index(drop=True, inplace=True)

df7['dt'].unique()

array([20191205, 20191204, 20191203, 20191202])

In [145]:
df8 = df7.groupby('dt').head()
df9 = np.round(np.average(df8["cr"]),3)
display(df8.head(12))
print("상위 5개 회사 평균 상승율 : ", df9)

           dt     name     cr
0    20191205  BNK금융지주  4.681
1    20191205      한진칼  3.488
2    20191205     삼성전기  3.139
3    20191205     삼성카드  2.186
4    20191205   한국조선해양  2.083
100  20191204      한진칼  4.032
101  20191204    엔씨소프트  3.093
102  20191204    웅진코웨이  2.879
103  20191204     한국전력  2.632
104  20191204   현대차2우B  2.469
200  20191203      오리온  4.390
201  20191203   대우조선해양  2.321

상위 5개 회사 평균 상승율 :  2.901

#### (6) 전체 기간에서 평균 등락이 높은 3개의 회사이름과 평균 등락 수치를 출력하세요. (cv: 등락)

In [169]:
cv1 = kospi_df.pivot_table("cv","name",aggfunc="mean")
cv2 = cv1.sort_values("cv",ascending=False)
result = cv2.reset_index(drop=False,inplace=False)
result.loc[:4]

       name     cv
0  삼성바이오로직스  945.0
1     NAVER  545.0
2     엔씨소프트  400.0
3        SK  320.0
4    아모레퍼시픽  275.0

In [170]:
result['cv'] = result['cv'].astype('int')
result = result.reset_index(drop=True,inplace=False)
result.tail()

      name   cv
95   롯데케미칼 -395
96    고려아연 -445
97     KCC -470
98  LG생활건강 -490
99    LG화학 -540

In [171]:
dict(zip(result['name'][:3],result['cv'][:3]))

{'삼성바이오로직스': 945, 'NAVER': 545, '엔씨소프트': 400}

#### (7) NAVER와 한국전력의 종가 데이터의 상관계수를 소수둘째자리까지 출력하세요. (ncv: 종가) 

 - 상관계수 수식
 
     $r = \frac{\Sigma(x-\bar{x})(y-\bar{y})}{\sqrt{\Sigma(x-\bar{x})^2\cdotp\Sigma(y-\bar{y})^2}}$

In [188]:
ncv1 = kospi_df.loc[kospi_df["name"] == "NAVER" ,["name","ncv","cr"]]
ncv2 = kospi_df.loc[kospi_df["name"] == "한국전력", ["name","ncv","cr"]]

result = pd.merge(ncv1,ncv2, how="outer", left_index=True, right_index=True)
result = ncv1.append(ncv2)
result

       name     ncv        cr
300   NAVER  174500 -0.290000
301   NAVER  175000  0.574713
302   NAVER  174000  2.052786
303   NAVER  170500 -2.292264
304   NAVER  174500  1.453488
...     ...     ...       ...
1695   한국전력   27250  4.807692
1696   한국전력   26000  0.580271
1697   한국전력   25850  1.372549
1698   한국전력   25500  0.196464
1699   한국전력   25450 -0.391389

[200 rows x 3 columns]

In [189]:
result = round(np.corrcoef(ncv1['ncv'], ncv2['ncv'])[0,1],2)
result

0.48